I collected daily stock “gainers” data from Yahoo Finance and the Wall Street Journal. 
For each trading day and time (e.g., morning, midday, close), I scraped or downloaded the gainers list and then loaded the resulting CSV files into Snowflake using the web UI file upload and `CREATE TABLE AS SELECT` patterns.

All of the tables used in this assignment live in:

- **Database:** `DS2508`
- **Schema:** `FCN2AY`

The gainers tables follow these naming patterns:

- `WSJGAINERS_YYYYMMDD_HHMMSS` for Wall Street Journal data  
- `YGAINERS_YYYYMMDD_HHMMSS` for Yahoo data  

In total, I have **N** gainers tables in this schema that match these patterns.

The `unique_syms` model aggregates symbols from all of the WSJ and Yahoo gainers tables and produces one row per unique symbol.

Conceptually, many rows from each source gainers table map to one row in the `UNIQUE_SYMS` table:

[ WSJGAINERS_YYYYMMDD_HHMMSS ]  --->  [ UNIQUE_SYMS ]
                  many                         one

[ YGAINERS_YYYYMMDD_HHMMSS ]   --->  [ UNIQUE_SYMS ]
                  many                         one

So the relationship is many-to-one: many gainers rows across all source tables map to one `symbol` in `UNIQUE_SYMS`.

d) https://github.com/<your-username>/<your-repo>/blob/mo10_dbt_model/models/example/unique_syms.sql

Below is the SQL from the model:

```sql
{{ config(materialized='table') }}

SELECT DISTINCT symbol
FROM (
    SELECT TO_VARCHAR(symbol) AS symbol FROM FCN2AY.WSJGAINERS_20251014_093133 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251014_160116 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251015_093119 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251015_123034 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251016_093113 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251016_160116 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251017_093120 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251017_123017 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251017_160116 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251027_123016 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251028_093118 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251029_093112 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251029_123016 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251029_160113 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251030_093111 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251030_123016 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251030_160114 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251031_093111 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.WSJGAINERS_20251031_160114 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.YGAINERS_20251014_123016 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.YGAINERS_20251015_160129 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.YGAINERS_20251016_123015 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.YGAINERS_20251016_160116 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.YGAINERS_20251017_123017 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.YGAINERS_20251017_160116 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.YGAINERS_20251027_093114 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.YGAINERS_20251027_160113 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.YGAINERS_20251028_123014 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.YGAINERS_20251028_160115 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.YGAINERS_20251029_093112 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.YGAINERS_20251031_093111 UNION ALL
    SELECT TO_VARCHAR(symbol) FROM FCN2AY.YGAINERS_20251031_123014
)
WHERE symbol IS NOT NULL

In [1]:
import pandas as pd

# Adjust filename if needed
df = pd.read_csv("unique_syms.csv")

print("Shape of UNIQUE_SYMS table:", df.shape)

# Show top 10 symbols
df.head(10)

Shape of UNIQUE_SYMS table: (861, 1)

  SYMBOL
0      0
1     19
2     29
3     37
4     43
5     45
6     53
7     65
8     56
9     84